{"title":"加油吧！少年——社会还在逼他们继续奋斗","date":"2020-04-22T05:18:50.000Z","date_formatted":{"ll":"2020年4月22日","L":"2020/04/22","MM-DD":"04-22"},"link":"posts/ca5d3c1d","comments":true,"categories":["杂文"],"updated":"2020-06-08T01:56:18.000Z","content":"<p><span id=\"inline-green\">文章引用知乎，视频源于B站</span></p>\n<iframe src=\"//player.bilibili.com/player.html?aid=58813904&bvid=BV1rt41157Qo&cid=102541012&page=1\" scrolling=\"no\" border=\"0\" frameborder=\"no\" framespacing=\"0\" allowfullscreen=\"true\" style=\"width: 640px; height: 430px; max-width: 100%\"></iframe><p>问题想的有点多，但以目前能力解决不掉。</p>\n<p>观点不代表大多数。</p>\n<p>不喜欢的直接喷！</p>\n<p>以下是从男方的角度写的。</p>\n<p>一:社会风气</p>\n<p>【也不能说是被当下社会风气影响吧】</p>\n<p>举个身边的例子吧。 </p>\n<p>1、男方自身经济实力不足（没钱）</p>\n<p>  我大致粗略算了算，假设我有一个喜欢我，而且我也喜欢的女孩子，两个人三观还都合得来，那么即使他们家的要求，按照我个人感觉的最低……  </p>\n<p>  我需要大概56万的一笔费用。<br>  也就是在老家桐城结个婚的所有花销。<br>  仅仅是结婚而已。<br>  房子30万首付得自己出吧（后续的贷款两人慢慢还。没毛病吧）<br>  车子最低10万吧？难道面包车也可以么？<br>  还有16万，彩礼+三金+婚宴（婚纱照司仪等等）+烟酒等等一系列所谓的看不见的花销……<br>  16万不过分吧？我感觉。<br>  这还是仅仅只是结婚，结完婚一年内要不要孩子呢？  </p>\n<p>2、这是个现实问题哦。<br>    要的话，媳妇一怀孕最低一年半至两年，所有的花销压力基本上男方负担了吧。  媳妇如果有嫁妆垫一垫也可以，可我是按照最坏的打算准备的。<br>    万一媳妇那边不随嫁妆呢？  </p>\n<p>3、小孩子不生病还好，一生病那钱花的……我大哥家的孩子一个月去医院两三次，一个月光在医院就一两千之多。这让人均工资在5.6000的家庭咋整？</p>\n<p>第二：责任问题  </p>\n<p>如果结婚真是那种到点就上班的活儿，那还好了，关键不是呀。  </p>\n<p>只是因为年轻人感觉到了，结婚对于一个男人/女人来说需要承担什么。  一种极重的责任感。<br>牵一发动全身的感觉。<br>双方父母，老婆孩子，大人还好啦，相对于小孩子来说，家庭条件不好的，从一开始他就落后别人一步了。<br>大多数普通人结了婚，娃娃一生，扔给爷爷奶奶带，自己出去打工。对吧。当然啦，这是没办法的事情，陪伴和赚钱只能二选一。<br>我从道德上表示理解，但个人情感上无法理解。<br>这些在我看来，这是一种极其不负责任的表现。<br>孩子在他小时候的大部分性格形成是需要父母的陪伴的，需要父母言传身教的。<br>父母和爷爷奶奶本质上是不同的，再开明的爷爷奶奶，对待小孩子从情感上就不同于父母。<br>另外没有父母陪伴，孩子没有底气，没有自信，当别的小朋友上学放学有爸妈接送，时间长了他会自己感觉和别人不一样。<br>心里种下了种子，等待的就是若干年后的矛盾和恶性后果。<br>我经常会听到有些家长说:那家小孩不是这样过来的，我们小时候都这样过来的，不也活的好好的，就你不行？<br>我想说的是：你愿意赌那万分之一，那是你的事，我不愿意。<br>重要的是我们90后长大了，有一大部分人都有过这样的经历，那个时候我们被称为“留守儿童”。  我们是经历过的，亲身体验到被留守是什么感觉。<br>可家长们看到的大多数”幸存者”都是有一点点运气在里面的，后面死掉的不知道多少。他们喜欢拿特例当典范，好比人家买彩票中一千万，我买怎么就不中？<br>你看看别人家如何如何，你怎么就不行？<br>或许也因为年轻人怕自己给不了孩子想要的生活，所以宁愿单着。<br>从某方面来说，也可以算是一种逃避和懦弱。<br>万一……我像我父母那样怎么办？我的孩子要重复我的一生么？<br>明知问题在哪儿，可就是无法解决。<br>人们叫嚣着让他们去努力，拼搏，积极向上……一堆堆的大道理扑面而来。<br>可年轻人现在接触的信息比以往更加的激烈和冲突。<br>他们深知这个世界没道理可言。<br>某些人说的都是建立在道德上的道理，现实中，只能精神慰藉。<br>就像我们都知道的“拾金不昧”“见义勇为”这种道德体系的东西，在我看来，这是社会结构的“大纲，骨架”。但流通的血液是权利和金钱。<br>可现如今……人心却不是以前的心了。</p>\n<iframe src=\"//player.bilibili.com/player.html?aid=36348709&bvid=BV1Qt41117b5&cid=63812343&page=1\" scrolling=\"no\" border=\"0\" frameborder=\"no\" framespacing=\"0\" allowfullscreen=\"true\" style=\"width: 640px; height: 430px; max-width: 100%\"></iframe><p>三：认识自己穷，怕给不了她幸福<br>大多数男生认识到自己穷了，这是真的，当今的社会，太过于物质化。<br>谁不希望能有一个童话般的爱情故事？<br>现实就是，柴米油盐酱醋茶会不断的用同一个招式把你从左边捶到右边。再从右边捶到左边。<br>没有物质滋养的爱情，没有光泽，没有保鲜期，古话说的好：贫贱夫妻百事哀。<br>我知道贫贱夫妻百事哀的原译文不是这个意思，但现在来形容另一种也不为过。<br>没有这个赚钱的能力，结了婚说白了:害人害己。<br>害了父母，害了媳妇，害了孩子，害了自己。<br>我希望的是男方可以在结婚前就有一定经济基础，或者工作稳定，有可观的稳定的收入来源，有一笔相对来说能够应付两到三年的花销存款，这是对家人也是对另一半和孩子的一种保障吧。<br>为什么这么说？时代不一样了，过去父母那辈儿结婚，物质条件的需求是啥？冰箱，收音机，摩托车。可以说人人通过努力都能达到，它的可得性要比现在大的多的多。现在呢？我有时回想起父辈们常说的一句:努力奋斗，肯吃苦，就可以把日子过好。现在想想……不以为然。<br>难道那些父辈们的吃苦耐劳，流血流汗还是算不上努力么？或者说他们的努力还不够？那为什么他们努力一辈子，却还要两代人合力都买不起一套房子了？还要绑定下一代二三十年的时间和收入，才能勉强有个“家”？<br>那这样努力，不就是个笑话呢？我不是说努力无用，努力是有用的，可你的努力追不上社会经济发展。这不是笑话，这是活生生的现实。<br>网络上有一句话:你不努力下，你都不知道什么是绝望。年前看上一套房，拼死拼活干一年，攒个十几万去交首付，结果房价涨了。只够买半个房子了。</p>\n<p>【笑哭】社会高速发展所带来的弊端，高房价，高物价，时时刻刻都在冲击着年轻人的三观和对社会美好的期待。</p>\n<p>混迹这么久 我一直在踏步 没有进步，还是会陷入最后的死结 如我所愿 我不是解决 我只是在逃避，最后还是想告诉你 如果当下很难 不要压抑自己 找一个信赖的人 哭一哭诉说一下真的很解压 然后在打起精神面对 多去做一些事情充实自己 看书 或者学一中乐器 给自己找点爱好 因为我们的生活里不能只有责任和义务  活的通透一些自私一些真的很好。</p>\n<p>不管如何，现在年轻人的压力是很大的，无论哪个城市都一样。买房、买车要花钱，结婚要花钱，照顾父母要花钱，抚养小孩要花钱……到处都要钱，然而现在的环境，物价房价飞涨的厉害，以现在大多数年轻人的收入，怎么能实现房车以及稳定情感的目标？<br>很难。</p>\n<p>说句实在话，倘若没有父母的帮扶，绝大多数的人是不可能买车买房的，光靠自己个人打拼，起码得打拼十多年，才能够实现自己的生活愿景。但是又有多少人能够忍得住十多年的时间，等到自己35岁以后再去实现这些事？</p>\n<p>在合适的年纪，做不了符合内心想做的事，这是现代年轻人觉得焦虑、感觉压力大的根本原因。</p>\n<p>现在是越年轻越轻松不了，只有奋斗，才能创造自己想要的生活。但是，当这种生活通过奋斗都还实现不了呢？就只能丧了。</p>\n<p>如果重来一次，你还会读计算机专业吗？</p>\n","prev":{"title":"C语言菜鸟笔记","link":"posts/4f274412"},"next":{"title":"PS简单的抠图方法","link":"posts/164adefb"},"plink":"https://dxsummer.gitee.io/posts/ca5d3c1d/","reward":true,"copyright":{"author":"DxSummer","link":"<a href=\"https://dxsummer.gitee.io/posts/ca5d3c1d/\" title=\"加油吧！少年——社会还在逼他们继续奋斗\">https://dxsummer.gitee.io/posts/ca5d3c1d/</a>","license":"Attribution-NonCommercial-NoDerivatives 4.0 International (<a href=\\\"https://creativecommons.org/licenses/by-nc-sa/4.0/\\\" rel=\\\"external nofollow\\\" target=\\\"_blank\\\">CC BY-NC-ND 4.0</a>)","published":"2020年4月22日","updated":"2020年6月8日"}}