{"title":"英语期末考试","date":"2020-07-02T12:12:49.000Z","date_formatted":{"ll":"2020年7月2日","L":"2020/07/02","MM-DD":"07-02"},"link":"posts/30564382","comments":true,"updated":"2020-07-02T13:32:30.000Z","content":"<h2 id=\"unit5\">Unit5<a href=\"#unit5\" title=\"Unit5\"></a></h2><h3 id=\"explore-1\">Explore 1<a href=\"#explore-1\" title=\"Explore 1\"></a></h3><p>My Mother’s Gift<br>　　母亲的礼物<br>　　I grew up in a small town where the elementary school was a ten-minute walk from my house and in an age, not so long ago , when children could go home for lunch and find their mothers waiting.<br>　　我是在一个小镇上长大的，从镇上的小学校到我家， 只需步行10分钟。离当前不算太太久远的那个时代 ， 小学生可以回家吃午饭，而他们的母亲，则会老早在家等候着。<br>　　At the time, I did not consider this a luxury, although today it certainly would be. I took it for granted that mothers were the sandwich-makers, the finger-painting appreciators and the homework monitors. I never questioned that this ambitious, intelligent woman, who had had a career before I was born and would eventually return to a career, would spend almost every lunch hour throughout my elementary school years just with me.<br>　　这一切对如今的孩子来说，无疑是一种奢望了，可是那时的我，却并不以为然。 我觉得做母亲的给她的孩子制作三明治，鉴赏指画，检查他们的家庭作业，都是理所当然的事。我从来没有想过：像我母亲这样一个颇有抱负又很聪明的女人，在我降生之前，她有一份工作，而且后来她又谋了份差事，可是，在我上小学那几年，她却几乎天天陪着我吃午饭，一同打发午餐时的每一分钟。<br>　　母亲的礼物 My Mother’s Gift<br>　　I only knew that when the noon bell rang, I would race breathlessly home. My mother would be standing1 at the top of the stairs, smiling down at me with a look that suggested I was the only important thing she had on her mind. For this, I am forever grateful.<br>　　只记得，每当午时铃声一响，我就一口气地往家里跑。母亲总是站在门前台阶的最高层，笑盈盈地望着我–那神情分明表示：我便是母亲心目中唯一最重要的东西了。为此，我一辈子都要感谢我的母亲。<br>　　Some sounds bring it all back: the high-pitched squeal2 of my mother’s teakettle, the rumble3 of the washing machine in the basement and the jangle of my dog’s license4 tags as she bounded down the stairs to greet me. Our time together seemed devoid5 of the gerrymandered schedules that now pervade6 my life.<br>　　如今，每当我听到一些声音，像母亲那把茶壶水开时发出的尖叫声，地下室洗衣机的隆隆声，还有， 我那条狗蹦下台阶冲我摇头摆尾时它脖子上那牌照发出的撞击声，便会勾起我对往事的回忆。和母亲在一起的岁月，全然没有充斥于我的生活中的、事先排定的虚情假意的日程表。<br>　　One lunchtime when I was in the third grade will stay with me always. I had been picked to be the princess in the school play, and for weeks my mother had painstakingly7 rehearsed my lines with me. But no matter how easily I delivered them at home, as soon as I stepped onstage, every word disappeared from my head.<br>　　我永远忘不了在我上三年级时的那一顿午饭。在那天之前，我被学校选中，要在一个即将演出的小剧中扮演公主的角色。一连好几个礼拜，母亲总是不辞辛劳地陪着我，一起背诵台词。可是，不管在家里怎么背得滚瓜烂熟，只要一上舞台，我的脑子里就成了一片空白。<br>　　Finally, my teacher took me aside. She explained that she had written a narrator’s part to the play, and asked me to switch roles. Her word, kindly8 delivered, still stung, especially when I saw my part go to another girl.<br>　　终于，老师把我叫到了一边。她说剧中旁白这个角色的台词已写好了，想把我替换下来当旁白。尽管老师这些话说得和和气气，可还是刺痛了我的心，特别是当我发觉自己扮演的公主角色让另外一个女孩顶替时，更是如此。<br>　　I didn’t tell my mother what had happened when I went home for lunch that day. But she sensed my unease, and instead of suggesting we practice my lines, she asked if I wanted to walk in the yard.<br>　　那天回家吃午饭时我没有把这事告诉母亲。然而，母亲见我心神不定，因此没有再提练习背台词的事儿，而是问我愿意不愿意到院子里散散步。<br>　　It was a lovely spring day and the rose vine on the trellis was turning green. Under the huge elm trees, we could see yellow dandelions popping through the grass in bunches, as if a painter had touched our landscape with dabs9 of gold .I watched my mother casually10 bend down by one of the clumps11. “I think I’m going to dig up all these weeds, “she said, yanking a blossom up by its roots.”From now on, we’ll have only roses in this garden.”<br>　　那真是一个可爱的春日，棚架上蔷薇的藤蔓正在转青。在一些高大的榆树下面，我们可以看到，一丛丛黄色的蒲公英冒出草坪，仿佛是一位画家为了给眼前的美景增色而着意加上的点点金色。我看到母亲在一簇花丛旁漫不经心地弯下身来。”我看得把这些野草都拨了，”她说着，一边使劲把一丛蒲公英连根拨出。”往后咱这园子里只让长蔷薇花。”<br>　　“But I like dandelions, “I protested. “All flowers are beautiful-even dandelions. “My mother looked at me seriously.”Yes, every flower gives pleasure in its own way, doesn’t it?” She asked thoughtfully. I nodded, pleased that I had won her over. “And that is true of people too, “she added.” Not everyone can be a princess, but there is no shame in that.”<br>　　可是我喜欢蒲公英，”我不满地说，”凡是花都好看–蒲公英也不例外。”母亲严肃地看着我。”噢，这么说，每朵花都自有它令人赏心悦目的地方喽？”她若有所思地问道。我点了点头，总算说服了母亲，这使我很得意。”可是人也一样呀，”母亲接着又发话，”不见得人人都能当公主，但当不了公主并不丢脸。”<br>　　Relieved that she had guessed my pain, I started to cry as I told her what had happened. She listened and smiled reassuringly12.<br>　　母亲猜到了我的苦恼，这使我的情绪安定下来。我哭了起来，把事情的经过讲给母亲听。母亲专注地听着，脸上带着安详的微笑。<br>　　“But you will be a beautiful narrator, “ she said , reminding me of how much I loved to read stories aloud to her . “The narrator’s part is every bit as important as the part of a princess.<br>　　“但你会成为一名顶呱呱的解说员，”母亲又说。她说平常我是多么喜欢朗诵故事给她听，还说”从哪方面看，旁白这个角色都和公主那个角色一样重要”。<br>　　My Mother’s Gift<br>　　母亲的礼物<br>　　I grew up in a small town where the elementary school was a ten-minute walk from my house and in an age, not so long ago , when children could go home for lunch and find their mothers waiting.<br>　　我是在一个小镇上长大的，从镇上的小学校到我家， 只需步行10分钟。离当前不算太太久远的那个时代 ， 小学生可以回家吃午饭，而他们的母亲，则会老早在家等候着。<br>　　At the time, I did not consider this a luxury, although today it certainly would be. I took it for granted that mothers were the sandwich-makers, the finger-painting appreciators and the homework monitors. I never questioned that this ambitious, intelligent woman, who had had a career before I was born and would eventually return to a career, would spend almost every lunch hour throughout my elementary school years just with me.<br>　　这一切对如今的孩子来说，无疑是一种奢望了，可是那时的我，却并不以为然。 我觉得做母亲的给她的孩子制作三明治，鉴赏指画，检查他们的家庭作业，都是理所当然的事。我从来没有想过：像我母亲这样一个颇有抱负又很聪明的女人，在我降生之前，她有一份工作，而且后来她又谋了份差事，可是，在我上小学那几年，她却几乎天天陪着我吃午饭，一同打发午餐时的每一分钟。<br>　　母亲的礼物 My Mother’s Gift<br>　　I only knew that when the noon bell rang, I would race breathlessly home. My mother would be standing at the top of the stairs, smiling down at me with a look that suggested I was the only important thing she had on her mind. For this, I am forever grateful.<br>　　只记得，每当午时铃声一响，我就一口气地往家里跑。母亲总是站在门前台阶的最高层，笑盈盈地望着我–那神情分明表示：我便是母亲心目中唯一最重要的东西了。为此，我一辈子都要感谢我的母亲。<br>　　Some sounds bring it all back: the high-pitched squeal of my mother’s teakettle, the rumble of the washing machine in the basement and the jangle of my dog’s license tags as she bounded down the stairs to greet me. Our time together seemed devoid of the gerrymandered schedules that now pervade my life.<br>　　如今，每当我听到一些声音，像母亲那把茶壶水开时发出的尖叫声，地下室洗衣机的隆隆声，还有， 我那条狗蹦下台阶冲我摇头摆尾时它脖子上那牌照发出的撞击声，便会勾起我对往事的回忆。和母亲在一起的岁月，全然没有充斥于我的生活中的、事先排定的虚情假意的日程表。<br>　　One lunchtime when I was in the third grade will stay with me always. I had been picked to be the princess in the school play, and for weeks my mother had painstakingly rehearsed my lines with me. But no matter how easily I delivered them at home, as soon as I stepped onstage, every word disappeared from my head.<br>　　我永远忘不了在我上三年级时的那一顿午饭。在那天之前，我被学校选中，要在一个即将演出的小剧中扮演公主的角色。一连好几个礼拜，母亲总是不辞辛劳地陪着我，一起背诵台词。可是，不管在家里怎么背得滚瓜烂熟，只要一上舞台，我的脑子里就成了一片空白。<br>　　Finally, my teacher took me aside. She explained that she had written a narrator’s part to the play, and asked me to switch roles. Her word, kindly delivered, still stung, especially when I saw my part go to another girl.<br>　　终于，老师把我叫到了一边。她说剧中旁白这个角色的台词已写好了，想把我替换下来当旁白。尽管老师这些话说得和和气气，可还是刺痛了我的心，特别是当我发觉自己扮演的公主角色让另外一个女孩顶替时，更是如此。<br>　　I didn’t tell my mother what had happened when I went home for lunch that day. But she sensed my unease, and instead of suggesting we practice my lines, she asked if I wanted to walk in the yard.<br>　　那天回家吃午饭时我没有把这事告诉母亲。然而，母亲见我心神不定，因此没有再提练习背台词的事儿，而是问我愿意不愿意到院子里散散步。<br>　　It was a lovely spring day and the rose vine on the trellis was turning green. Under the huge elm trees, we could see yellow dandelions popping through the grass in bunches, as if a painter had touched our landscape with dabs of gold .I watched my mother casually bend down by one of the clumps. “I think I’m going to dig up all these weeds, “she said, yanking a blossom up by its roots.”From now on, we’ll have only roses in this garden.”<br>　　那真是一个可爱的春日，棚架上蔷薇的藤蔓正在转青。在一些高大的榆树下面，我们可以看到，一丛丛黄色的蒲公英冒出草坪，仿佛是一位画家为了给眼前的美景增色而着意加上的点点金色。我看到母亲在一簇花丛旁漫不经心地弯下身来。”我看得把这些野草都拨了，”她说着，一边使劲把一丛蒲公英连根拨出。”往后咱这园子里只让长蔷薇花。”<br>　　“But I like dandelions, “I protested. “All flowers are beautiful-even dandelions. “My mother looked at me seriously.”Yes, every flower gives pleasure in its own way, doesn’t it?” She asked thoughtfully. I nodded, pleased that I had won her over. “And that is true of people too, “she added.” Not everyone can be a princess, but there is no shame in that.”<br>　　可是我喜欢蒲公英，”我不满地说，”凡是花都好看–蒲公英也不例外。”母亲严肃地看着我。”噢，这么说，每朵花都自有它令人赏心悦目的地方喽？”她若有所思地问道。我点了点头，总算说服了母亲，这使我很得意。”可是人也一样呀，”母亲接着又发话，”不见得人人都能当公主，但当不了公主并不丢脸。”<br>　　Relieved that she had guessed my pain, I started to cry as I told her what had happened. She listened and smiled reassuringly.<br>　　母亲猜到了我的苦恼，这使我的情绪安定下来。我哭了起来，把事情的经过讲给母亲听。母亲专注地听着，脸上带着安详的微笑。<br>　　“But you will be a beautiful narrator, “ she said , reminding me of how much I loved to read stories aloud to her . “The narrator’s part is every bit as important as the part of a princess.<br>　　“但你会成为一名顶呱呱的解说员，”母亲又说。她说平常我是多么喜欢朗诵故事给她听，还说”从哪方面看，旁白这个角色都和公主那个角色一样重要”。<br>　　Over the next few weeks, with her constant encouragement, I learned to take pride in the role. Lunchtimes were spent reading over my lines and talking abut13 what I would wear.<br>　　往后的几个星期，在母亲的一再鼓励下，我渐渐地以担任旁白的角色感到骄傲。利用午饭时间，我们又一起念台词，议论到时候我该穿什么样的演出服装。<br>　　Backstage the night of the performance, I felt nervous. A few minutes before the play, my teacher came over to me. “Your mother asked me to give this to you, “ she said, handing me a dandelion. Its edges were already beginning to curl and it flopped14 lazily from its stem. But just looking at it, knowing my mother was out there and thinking of our lunchtime talk, made me proud.<br>　　到了演出那个晚上，当我登上后台，心里还感到紧张。离演出还有几分钟的时候，老师朝我走了过来。”你母亲让我把这个交给你，”说着她递过来了一朵蒲公英。那花儿四周已开始打蔫，花瓣儿从梗上向下有气无力地耷拉着。可是，只要看一眼，知道母亲就在外面呆着，回想起和母亲用午饭时说的那些话，我就感到胸有成竹。<br>　　After the play, I took home the flower I had stuffed in the apron15 of my costume. My mother pressed it between two sheets of paper toweling in a dictionary, laughing as she did it that we were perhaps the only people who would press such a sorry-looking weed.<br>　　演出结束后，我把塞在演出服围裙里的那朵蒲公英拿回了家。母亲将花接了过去，用两张纸巾将它压平，夹在了一本字典里。她一边忙碌着，一边笑，想到也许只有我们俩会珍藏这么一朵打了蔫的野草花。<br>　　I often look back on our lunchtimes together, bathed in the soft midday light. They were the commas in my childhood, the pauses that told me life is not savored16 in premeasured increment17, but in the sum of daily rituals and small pleasures we casually share with loved ones. Over peanut-butter sandwiches and chocolate-chip cookies, I learned that love, first and foremost, means being there for the little things.<br>　　我常常回想起和母亲在一起度过的那些沐浴在和煦阳光之中的午餐时光。它们是我孩提时代的一个个小插曲，告诉我一个道理：人生的滋味，就在于和我们所爱的人在一起不经意地共度的日常生活、分享的点点滴滴的欢乐，而不在于某种事先测量好的”添加剂”。在享用母亲做的花生酱、三明治和巧克力碎末小甜饼的时候，我懂得了，爱就体现在这些细微这处。<br>　　A few months ago, my mother came to visit. I took off a day from work and treated her to lunch. The restaurant bustled18 with noontime activity as businesspeople made deals and glanced at their watches. In the middle of all this sat my mother, now retired19, and I. From her face I could see that she relished20 the pace of the work world.<br>　　几个月前，母亲又来看我。我特意请了天假，陪母亲吃午饭。中午，饭馆里熙熙壤攘，做生意的人忙不迭地从事交易活动，他们不时地看看手表。如今已经退休的母亲和我就坐在这群人中间。从母亲的表情中，我看得出，母亲打心眼里喜欢上班族这种生活的节奏。<br>　　“Mom, you must have been terribly bored staying at home when I was a child,” I said.”Bored? Housework is boring. But you were never boring. “<br>　　“妈，我小的时候，您老呆在家里一定觉得很烦吧？”我说。”烦？做家务是令人心烦，不过，你从来没使我感到心烦过。<br>　　“I didn’t believe her, so I pressed.”Surely children are not as stimulating21 as a career.”<br>　　我不相信这是实话，于是我又想法子套她的话。”看孩子哪会像工作那样富有刺激性呢？”<br>　　“A career is stimulating,” she said.” I’m glad I had one. But a career is like an open balloon. It remains22 inflated23 only as long as you keep pumping. A child is a seed. You water it. You care for it the best you can. And then it grows all by itself into a beautiful flower.”<br>　　“工作是富有刺激性的，”母亲答道，”很高兴我也有过工作。可是工作好比开了口的气球，你只有不停地充气，它才能鼓着劲。可是一个孩子就是一粒种子，你浇灌了它，全心全意地爱护它，然后，它就会独立自主地开出美丽的花朵来。”<br>　　Just then, looking at her, I could picture us sitting at her kitchen table once again, and I understood why I kept that flaky brown dandelion in our old family dictionary pressed between two crumpled24 bits of paper towel.<br>　　此时此刻，我凝望着我的母亲，脑海里又浮现出儿时的我和母亲一起坐在饭桌旁的情景，也明白了为什么我还珍藏着夹在我们家里那本旧字典中的那朵用两小块皱皱巴巴的纸巾压平的蒲公英。</p>\n<p>It was 1) a lovely spring day. Under the huge elm trees, we could see 2), yellow dandelions in the grass. My mother 3)_ pulled up dandelions by their roots and said that she was going to 4) dig up all these weeds. 15)_ protested_ and said that even dandelions are beautiful. My mother looked at me 6)_ seriously confirming that every flower 7) gives pleasure in its own way, and so do people. She added that not everyone can be a princess, but there is 8). no shame in that. 9)_ Relieved that she had guessed my pain, I 10)<em>_ started tocry as I told her what had happened. She listened and smiled 11). reassuringly She told me that the narrator’s part is as important as the part of a princess and 12). encouraged me to be a beautiful narrator. I learned to 13) take pride in the role.It was 1) a lovely spring day. Under the huge elm trees, we could see 2), yellow dandelions in the grass. My mother 3)</em> pulled up dandelions by their roots and said that she was going to 4) dig up all these weeds. 15)_ protested_ and said that even dandelions are beautiful. My mother looked at me 6)_ seriously confirming that every flower 7) gives pleasure in its own way, and so do people. She added that not everyone can be a princess, but there is 8). no shame in that. 9)_ Relieved that she had guessed my pain, I 10)<em>_ started tocry as I told her what had happened. She listened and smiled 11). reassuringly She told me that the narrator’s part is as important as the part of a princess and 12). encouraged me to be a beautiful narrator. I learned to 13) take pride in the role.</em></p>\n<p>1 How do we live a better life? Most people have this question on their mind . 2 My father, takes a week off every year to travel with uS. 3 For college students, the ability of solving problems is_ every bit as_ important as the knowledge they learn in class. 4 The pianist says he _ is grateful_ to his parents for . their encouragement and support. 5 It’s no secret that many children would be happier with their adoptive parents (养父母). That is especially_ true of children who are badly treated by their biological parents. 6 At first they didn’t want to join uS for dinner, but we finally_ won them over 7 The yard was bathed in bright sunshine where my mother grew various kinds of vegetables. 8 When I look back on my childhood, I can barely remember what I did or liked or watched.</p>\n<p>1 Most people would prefer to be cared_ for at home rather than in a hospital. 2 | can well remember how proud I was when my mother was asked to_ deliver_ . a speech at a parent-teacher conference. 3 My parents are now so accustomed to Android (安卓操作系统) that they don’t want to switch_ to iPhone. 4 Excited at his success, I told my cousin that I would treat him to dinner and he could name the restaurant. 5 My mother is quite forgetful. | have to_ remind her of her promise. 6 Parents_ protested_ against the school’s decision to cut down music lessons. 7 My parents take pride in my accomplishments, which are stepping stones to my dreams. 8 As he grew up, his parents were gradually_ relieved of the burden of planning for his future.When the author treats her mother to a lunch, she 1)， remembers again her childhood lunchtimes with her mother. After her birth, her mother 2)_ quit her job and stayed home, taking care of her. Her mother would spend almost every lunch hour with her throughout her elementary school years. She had never 3). guestioned that and took everything for granted. When she grew up, she thought she mattered less than a(n) 4), stimulating career to her mother, but she was wrong. In fact, her mother enjoyed their time together because a child is like a(n) 5) seed_ which grows all by itself into a beautiful flower as long as one cares for it. The pressed dandelion in the family dictionary 6)_ reminds her of the most unforgettable lunchtime with her mother. Being told that she had to 7)_ switch_ roles in a school play, she felt quite uneasy. During the walk in the yard, her mother made her realize everybody has their own existence value just as all flowers give 8) pleasure_ in their own ways. With her mother’s constant 9) encouragement, she learned to take pride in the role and spent the lunchtimes reading over her lines and talking about what she would wear. Her mother’s company during lunchtimes and the dandelion her mother gave her on the night of the performance 10)_ mean<br>much to her.</p>\n<h3 id=\"explore2\">explore2<a href=\"#explore2\" title=\"explore2\"></a></h3><p>In the faint light of the attic, an old man, tall and stooped, bent his great frame and made his way to a stack of boxes that sat near one of the little half-windows. Brushing aside a bit of a spider ‘s web, he pointed the top box toward the light and began to carefully lift out one old photograph album after another. Eyes once bright but now dim searched longingly for the source that had drawn him here. It began with the fond memory of the love of his life, long gone, and somewhere in these albums was a photo of her he hoped to rediscover. Silent as a mouse, he patiently opened the long buried treasures and soon was lost in a sea of memories. Although his world had not stopped spinning when his wife left it, the past was more alive in his heart than his present aloneness. Setting aside one of the dusty albums, he pulled from the box what appeared to be a journal from his grown son’s childhood. He could not recall ever having seen it before, or that his son had ever kept a journal. Why did Elizabeth always save the children’s old junk? He wondered, shaking his white head.Opening the yellowed pages, he glanced over a short reading, and his lips curved in an unconscious smile. Even his eyes brightened as he read the words that spoke clear and sweet to his soul. It was the voice of the little boy who had grown up far too fast in this very house, and whose voice had grown fainter and fainter over the years. In the utter silence of the attic, the words of an innocent six-year-old worked their magic and carried the old man back to a time almost totally forgotten. Entry after entry stirred an emotional hunger in his heart like the longing a gardener feels in the winter for the fragrance of spring flowers. But it was accompanied by the fact that his son’s simple memories of those days were far different from his own. But how different? Reminded that he had kept a daily journal of his business activities over the years, he closed his son’s journal and turned to leave, having forgotten the cherished photo that originally triggered his search. Trying to avoid bumping his head, the old man stepped to the wooden stairs that led to the study. Opening a glass cabinet door, he reached in and pulled out an old business journal. Turning, he sat down at his desk and placed the two journals beside each other. His was leather-bound with his name printed neatly in gold, while his son’s had not been well kept and the name Jimmy had been nearly erased from its surface. He ran a long skinny finger over the letters, as though he could restore what had been worn away with time and use.As he opened his journal, the old man’s eyes fell upon a passage that stood out because it was so brief in comparison to other days’. In his own neat handwriting were these words: Wasted the whole day fishing with Jimmy. Didn’t catch a thing. With a deep sigh and a shaking hand, he took Jimmy’s journal and found the boy’s entry for the same day, June 4. Large letters, pressed deeply into the paper, read: Went fishing with my dad. Best day of my life.</p>\n<p>1 Her grandmother was always insisting that she was tooskinny and was never tiredof trying to force more food on her.2 They switched off all lights and waited for their lttle sister in thefaint___ light ofcandles, hoping to give her a birthday surprise.3 When they were talking about the education of children, his remarks on strict disciplinetriggered_ heated debate.4 Thanks to the _ emotional support from my family, I finally went through the tough timein my freshman year.5 Show your care to people youcherish__ most and let them feel they are important inyour life.6 He seemed so young and__ innocent_ that no one expected he’d have done things like that.</p>\n<p>1 Though upsetting events happened to the family_ one by one_, the family became closer than ever. 2 Water, if it drops continually, will make a stone disappear; this is true of our mind and efforts in front of difficulties. 3 The boy walked slowly to the door to go out, trying not to be noticed by his mother. 4 Feeling tired, he put his pen to one side and read over what he had written. 5 The children went together with their parents and teachers on their field trip on the Children’s Day. 6 She looks very short compared with other children of the same age.1 | had to bury myself in a stack of textbooks before the final exams, while my mother would always get me a glass of milk when I was tred. 2 We parked beneath a clump of trees a hundred meters away from the entrance of the museum. 3 He always brought with him a bunch of flowers for his mother when he came home. 4 In fact, without a clear searching target, you might be drown in a sea of information when surfing online. 5 The couple have an album of stamps from all over the world which make them remember their traveling in their early years. 6 Start budgeting and saving to repay student loans so you won’t face a mountain of debts for years.</p>\n<h3 id=\"翻译\">翻译<a href=\"#翻译\" title=\"翻译\"></a></h3><p>家庭对中国人来说极其重要;随着时代的发展，中国人的家庭观念也在发生着变化。</p>\n<p>The family is of crucial importance to Chinese people. As time goes on,<br>Chinese people’s attachment to the family has been changing.</p>\n<p>在中国，一个人孝顺自己的父母长辈,不仅仅是个人的道德行为,也是对社会承担的- -份责任。<br>(filial piety; commitment)</p>\n<p>In China, practicing filial piety toward parents and elders is not only a<br>personal moral behavior, but also a commitment to society.</p>\n<p>中国人在情感表达方面比较含蓄，但这并不代表我们不真挚，不热烈。(implicit; sincere;<br>enthusiastic)</p>\n<p>Chinese people are relatively implicit in expressing their emotions, but this<br>doesn’t mean that we are not sincere or enthusiastic.</p>\n<p>年夜饭是中国人重要的情感寄托，吸引着世界各地的中国人回家庆祝春节。(reunion dinner;<br>bear; from all corners)</p>\n<p>The reunion dinner, important for bearing the emotions of Chinese people,<br>draws them from all corners of the world to return home and celebrate the<br>Spring Festival.</p>\n<h2 id=\"unit-7\">Unit 7<a href=\"#unit-7\" title=\"Unit 7\"></a></h2><h3 id=\"explore-1-1\">Explore 1<a href=\"#explore-1-1\" title=\"Explore 1\"></a></h3><p>Chinese Technology</p>\n<p>When I moved to China in 2004,I took a short trip to Zhaoxian County in Hebei Province to see a bridge.A bridge?Yes.This was not just any bridge.It was the Zhaozhou Bridge,completed in AD 605,the earliest and best-preserved open-spandrel stone arch bridge in the world.In 1991,it was designated as the International Historic Civil Engineering Landmark,equally famous as the Eiffel Tower in Paris,the Panama Canal in Central America,and the Pyramids in Egypt.</p>\n<p>This experience helped shape my view of China as innovative.It informed my work over the next dozen years as a teacher and consultant working with private companies,state-owned enterprises,universities and government agencies.</p>\n<p>At college,I became familiar with China’s four great inventions:gunpowder,papermaking,printing and the compass.The inventions,in the words of the English philosopher Roger Bacon,changed the whole appearance and status of things in the world.For most Westerners,this is all we learned about China’s technological achievements.But,if we dig a little deeper,we will uncover a rich tradition of technological innovation.We learn that China’s global firsts include paper currency,oil wells,and even the explanation of the camera obscura.The list goes on and on.China was ahead of the time in some fields until the early years of the Qing Dynasty.Chinese discoveries and innovations contributed to the economic development of Asia and Europe.</p>\n<p>The rise of modern China’s technological achievements should not come as a surprise to anyone.It is built on a long history of innovation.Indeed,its achievements have captured global attention.For example,China’s progress in clean technology drew praise from Steven Chu,former Secretary of the US Department of Energy.He once identified several crucial technologies,mostly in the areas of power generation and transportation,where China is leading.</p>\n<p>High voltage transmission</p>\n<p>China has deployed the world’s first-class ultra-high voltage AC and DC lines—including one capable of delivering 6.4 gigawatt to Shanghai from a plant over 1,900 kilometers away in southwestern China.</p>\n<p>High-speed rail</p>\n<p>China’s high-speed railways have witnessed significant development in recent years.Its highspeed railway technology has reached the world’s advanced level and has been exported to other countries.China also has the world’s greatest high-speed network—22,000 kilometers at the end of 2016,or about 60 percent of the world’s total.</p>\n<p>Advanced coal technologies</p>\n<p>China is rapidly deploying supercritical and ultra-supercritical coal combustion plants,which have fewer emissions and are more efficient than conventional coal plants because they burn coal at much higher temperatures and pressures.</p>\n<p>Energy-saving and new-energy vehicles</p>\n<p>China has invested a lot in fuel economy,hybrids,and electric and fuel cell vehicles.It’s expected that at least one in every five cars sold in China will be a new-energy model by 2025.</p>\n<p>Supercomputing</p>\n<p>China’s Sunway TaihuLight,developed by the Chinese National Research Center of Parallel Computer Engineering&amp;Technology,is the world’s fastest supercomputer,according to the TOP500 list of supercomputers released in November 2017.The Sunway TaihuLight was built entirely using processors designed and made in China.</p>\n<p>Likewise,China’s ambitious space program has been progressing at a rapid pace.China has given the world a first glimpse of its design for the space probe and rover which the country plans to use in its first mission to Mars in mid-2020.On August 16,2016,China launched a potentially groundbreaking quantum-enabled satellite,testing new communications technology.In early August 2016,its Jade Rabbit lunar rover shut down after operating on the Moon for 31 months.</p>\n<p>Where will China go from here?How will the rapid growth of technological innovations be developed and applied?Since 2014,China has been promoting mass entrepreneurship and innovation to cultivate grass-roots entrepreneurship throughout the country.According to the government,science and technology will contribute to 60 percent of the country’s economic growth in the near future.</p>\n<p>In addition to the top-down goal to upgrade its innovation capacity in order to stay competitive,China’s innovation drive is also being led by bottom-up factors such as the rise of Chinese entrepreneurs who are disrupting traditional industries.Technological influences are helping China leapfrog its innovation process.</p>\n<p>In my own work with private companies,state-owned enterprises,and government agencies,I have witnessed remarkable changes in the way technology is developed and applied to meet real world challenges.Particularly of importance has been the growing cooperation between private entrepreneurs and the government.From my experience,I am optimistic that China will achieve much in more technologies and that the development of grass-roots entrepreneurship will be successful.</p>\n<p>To encourage innovation, China 1) has been developing (develop) indigenous (本土的) technicalstandards. One example is the TD-SCDMA, the 3G standard. China initially 2)<strong>launched(launch) a national TD-SCDMA network in 2005, but the network only 3)</strong> reached(reach)large-scale commercial trials with 60,000 users across eight cities in 2008. On January 7, 2009,China 4)<strong><em>granted (grant) a TD-SCDMA 3G license to China Mobile. China Mobile officially5)</em> announced (announce) on September 21, 2009 that it had had 1 ,327,000 TD-SCDMAusers by the end of August 2009. Critics claim that the standard 6)_</strong> delayed (delay) 3Gintroduction, while supporters argue that it 7)<em>_ increased</em> (increase) technical experience and8)_ enhanced_ (enhance) China’s competitiveness regarding 4G.</p>\n<p>1 A space engineer says we shouldpreserve_ the satellites after they finish their missionsin the same way we__ preserveships, aircraft and trains in museums.2 He works as a(n) _ consultant for Chinese and foreign institutions and gives advice onenvironmental protection.3 China’s space industry has witnessed rapid progress since 2011.4 Jiaozi (交子) first appeared in the Northern Song Dynasty and is the earliest papercurrency in the world.5 If the cost of developing a technology is high, a more <em>efficient way is to buy thetechnology abroad.6As China’s transport and industrial capacities have beenupgraded , China’s directexports and imports have tended to increase more rapidly.7Our products adopt advanced security measures; . _ likewise</em> , our services protect banks’customers from identity theft.8 To make products creative, Steve Jobs encouraged and_ cultivated creativity of his staffin the company.</p>\n<p>1 Future generations will probably be able to atrip around the Earth in private spacecraft. 2 China is developing an advanced new spaceship_ capable_ of both flying in low-Earth orbit and landing on the Moon. 3 Taking into account the creativity and diligence of the Chinese, China’s remarkable development does not come as a surprise. 4 For the next few years, the satellite will travel further in the space and dig_ deeper to find its beauty. 5 China, as is widely recognized, has made great progress in science and technology. 6 This new product will help those who suffer from sleeplessness and view__ sleep as a luxury. 7 People are moving into urban centers at a record pace in search of high-paying jobs.</p>\n<p>1 Thousands of people had gathered along the road, hoping to catch L have L get a glimpse of their heroes. 2 To protect their living environment, the local people opposed the plan to construct one more coal-fired power plant that would undoubtedly bring air pollution. No one can foretell the result of an innovation, but the successful innovation aims from the beginning to become the standard setter, and to determine the direction of a new technology or a new industry. 4 The research group put forward a plan to the board of the company, intending to improve their efficiency of production in the following five years. 5 Product innovation involves the development of new products, changes in design of established products, or use of new materials in the production of established products. 6 He talked about his ambitious goal, but failed to mention any serious steps his company would take to reach L pursue the goal .</p>\n<p>The four great inventions of ancient China refer to papermaking, gunpowder, printing and the compass. The statement was first 1) put forward by British sinologist (汉学家) Dr. Joseph Edkins and was later widely accepted by Chinese historians. These inventions enormously 2)_ promoted_ the development of China’s economy, politics and culture. The four inventions were introduced to the Western countries through various channels. They changed the appearance and 3)_ status_ of the things in the world. Would the explorer Marco Polo have 4)<strong>_ sailed across the ocean in the 13th century without a compass? Most Westerners are familiar 5) with the four inventions. In fact, if people dig a ittle deeper, they will 6)_ uncover a long list of China’s technological achievements, including the first paper currency in the world. That means China was 7)</strong> ahead of the time in science and technology in many areas, and that Chinese discoveries and innovations 8) contributed much to the development of world civilization. Today the world has 9) _ witnessed_ China’s greater advances in technology, mostly in the areas of power generation and transportation. It’s safe to say that China’s steady development into an industrial nation does not come as a(n) 10) surprise</p>\n<h3 id=\"explore-2\">Explore 2<a href=\"#explore-2\" title=\"Explore 2\"></a></h3><p>We were first introduced to the idea ofvirtual reality (VR) in the 1999 sci-fi film, TheMatrix. In the multimillion-dollar film series,Keanu Reeves’ character, Neo, found himselfliving between two worlds and fighting badguys, generally making the whole concept ofVR seem pretty cool.Entertaining, yes. But realistic?While the 1990s version of VR we werepromised in films like The Matrix and Thelawnmower Man might remain firmly on thesilver screen, VR is the future.And it’s something we need to pay attentionto. As we see, VR isn’t going away. Theclearest sign that VR is the future came inJuly 2014 when Facebook bought OculusVR for a cool $2 billion. VR is growing, andbecoming more accessible by the day. Soon,itll be as commonplace as an iPhone.</p>\n<p>Here are just a few predictions for how VR will change our lives.GamingAs we’ve already touched on the Oculus Rift headset, it makes sense to start withgaming. After all, this is the most obvious - and demonstrated - example of VR in action.Facebook wouldn’t have acquired Oculus had it not seen the potential in VR, anothersign that it’s only going to get bigger.Even before it has gone mainstream, Oculus already supports a vast number of games.And this list is growing all the time. Sony and Samsung are also releasing similar VRheadsets, and the increased competition will force designers to make their games andexperiences more intense, immersive and impressive.Watching films3D films are nothing new, but they’ re not really as exciting and three-dimensional asthe audience were expecting. Just imagine how much the film experience could beenhanced when we throw VR into the mix.We’d be in control of the movie world. We can look around as we want, see the action fromdifferent angles, and choose where to give our full attention. This is all still theoretical atthe moment, but it really could change the way we watch films in the future.</p>\n<p>Seeing the worldWe all get a desire to travel every now and again, but money, responsibilities and dailylife all get in the way of us hopping on a plane and jetting off to sunnier climates.VR could help us see the world, without leaving our living rooms. We could tourmuseums and monuments remotely, take in some amazing scenery, and even just relaxon a “beach” - all without a passport.SurgeryThis is one area where VR is already being used, as it’s safer for trainee surgeons toperfect their techniques in a realistic environment. Fully interactive models can sufferfrom a selection of ailments, and surgeons can learn new techniques and trainees canput theory into practice without an unrealistic plastic model, or the pressure of a real-life situation.Space explorationSpace travel is expensive, not to mention nearly impossible for Joe Bloggs. The chancesof heading off into space are pretty slim even if you’re an astronaut. But VR makes thisexpensive - and sometimes dangerous - exploration, much easier.Scientists can safely explore from ground control, heading out much deeper into spacethan would be humanly possible otherwise. It’s a really exciting way VR could changeour lives.</p>\n<p>Training and developmentPilots already use flight simulators but, like surgeons, could seriously benefit fromsomething a lot more realistic to help perfect their skills. There are already a wholehost of games where we can develop our skills, but even real pilots could benefit fromthe level of immersion virtual reality has to offer.Improving quality of life Lastly - but by no means least - virtual reality has the potential to transform the livesof those who aren’t capable of living a normal life. It gives them the opportunity toexplore and experience the world - even to do things we take for granted - and that’sthe biggest thing VR has to offer.The possibilities really are endless where virtual reality is concerned. It really doeshave the potential to change our lives and the world we live in. Time will tell whatkind of impact VR has, but one thing’s for sure - there’s so much more to virtual realitythan gaming.</p>\n<p>1 With the DSLR camera (数码单反相机) becoming more and more popular, its video functionhas really broken into the_ mainstream2 Smartphone apps can be brilliant, but | don’t think it___ realistic__ to expect the apps tosolve all our problems.3 As games blend our real and___ virtual_environments, should there be concern thatsome people will be less able to distinguish between the two?4 VR technology allows us to enjoy the___ scenery__ of a place without stepping outof home.5 Facebook is ready to make the application of virtual reality in our lives a(n) commonplace.6 NASA should provide its astronauts with lifetime health care for all ilnesses, even if theirailments_ do not necessarily stem from space.7 Chinese researchers have created a model for the_ prediction_ of cardiovascular (心血管的)disease risk, which will help prevent and manage the disease.8 A___vastnumber of vendors in China use WeChat’s wallet, so even if you buy aroasted sweet potato on the street, you will probably be able to pay with it.</p>\n<p>Though it is a sci-fi movie for children, it is by no means as simple as it may have firstappeared; it runs a strong sense of humor.We should be _ in control of the AI development, reaping its benefits and avoiding itspotential problems.Using technology in the classroom helps teachers satisfy students individually, not to mentionteach them how to find trustworthy sources online.It is said that if airlines saw the benefits of in-flight wi-fi_ in action , they would getplanes equipped faster.For sure__ we can come up with a way for the robot to ask a question when it is notsure of our commands.| resist getting a smartphone because I am afraid it would get in the way of enjoying my life,with all the temptations to waste time in a thousand different ways.</p>\n<h3 id=\"翻译-1\">翻译<a href=\"#翻译-1\" title=\"翻译\"></a></h3><p>中国的四大发明，即造纸术、指南针、火药、印刷术，对世界文明的发展产生了巨大影响。( have .an impact on; civilization )</p>\n<p> The four great inventions of China, namely papermaking, the compass,gunpowder and printing, have had a great impact on the development ofthe world civilization.</p>\n<p>高铁给人们带来了极大的便利，也改变着人们的生活方式和工作模式。( pattern )</p>\n<p> High-speed rail has brought much convenience to people, and has alsoaltered people’s lifestyles and work patterns.</p>\n<p>在创新战略的推动下，中国一批具有世界顶尖水平的企业在航天研究、生命科学、金融科技等领域脱颖而出。( world top-level; distinguish )</p>\n<p> Encouraged by the innovation strategy, a number of world top-level Chineseenterprises have distinguished themselves in such fields as space research,life science and financial technologies.</p>\n<p>明代著名医药学家李时珍运用观察和实验、比较和分类、分析和综合的方法，积累了医学研究新经验。( medical expert; classification; synthesis; gather )</p>\n<p>Li Shizhen, the famous medical expert in the Ming Dynasty, adoptedmethods of observation and experiments, comparison and classification, andanalysis and synthesis to gather new experience in medical research.</p>\n<h2 id=\"unit-8\">Unit 8<a href=\"#unit-8\" title=\"Unit 8\"></a></h2><h3 id=\"explore-1-2\">Explore 1<a href=\"#explore-1-2\" title=\"Explore 1\"></a></h3><p>The stereotype of the hard-working Chinese has been around for a long time in theWest. As early as 1894, Arthur Smith, an American who spent 54 years in China, wrotebooks introducing the hard-working Chinese people to the world. In his book ChineseCharacteristics, Smith wrote about the diligence of not just a single group of Chinesepeople, but of all the Chinese: young and old, rich and poor, farmers and scholars.Smith is not the only foreign guest to note that the Chinese are an extremely hard-working people. In 1895, another American in Beiing noted that Chinese people oftenworked from dawn to dusk, seven days a week, tirelessly. Later, in the early 20thcentury, British and American government officials serving in China also commentedthat Chinese people were without rest. Carl Crow, an American newspaperman andbusinessman who opened up the first Western advertising agency in Shanghai, oncesaid:“If it is true that the devil can only find work for idle hands, then China must be aplace of very limited satanic activities.”Chinese literature and folklore have many moral tales about industrious farmers andpeasants. The willingness to work hard and make maximum use of time has beenhighly valued in China since ancient times. There are many stories about farmers whogo to their fields even during holidays, or of peasants who think not only of themselvesand their families, but also of their community and future descendants.The Chinese trait of being unselfish and hard-working continues. Today, unselfishthinking, combined with the willingness to work hard, has given the Chinese a globalreputation of having a stable and industrious workforce. Western employers note thatthe values and beliefs of the Chinese workforce are compelling: The Chinese valueeducation, the virtue of hard work, and self improvement. Whether working in thefields or in the factories, they are willing to do more and go beyond the minimum,</p>\n<p>because they assume that their work will benefit them and their families. Because ofthis extended benefit, the Chinese do not complain about working hard.This work ethic is not only for adults. All over China you will find children and youngstudents attending classes outside their regular studies. Students take courses, oftenuntil late at night and during the weekends. Part of these activities may be related tothe intense competition that Chinese students face, but part of them are based upon thedesire to excel academically.Why do Chinese people work so hard, regardless of age or occupation?One answer rests in socialization. Chinese people are socialized differently from召Westerners. They grow up with different values, including a different estimation aboutthe importance of working hard. Hard work is considered a virtue in Chinese culture,as opposed to a necessity in American culture. For youth, Chinese textbooks and socialactivities emphasize this as well.Hard work is also part of the national ethic. The Chinese leadership is committed tobuilding the country into a strong, successful, global nation and the country urges itscitizens to participate in this process. Diligence is part of political awareness. Moreover,this political awareness fits into the economic ethic of Chinese entrepreneurship.</p>\n<p>In China, an entrepreneur is not just a small-time private business owner. He issomeone who is willing to invest his resources (land, labor, capital) and look towarda long-term goal. The Chinese entrepreneur seeks to improve his life and also thematerial well-being of a group around him - his family, his community, and his nation.True, Chinese entrepreneurs want security. They tend to be conservative and frugal,in opposition to Western risk-takers. They also tend to seek to benefit the group ratherthan themselves alone. This ethic is found not just among businessmen, but in everyoccupation, gender and age. The quest for material gain, a financially secure family,and a peaceful, prosperous nation have been the goals of Chinese people for ages.Today, Chinese culture also has strategies that allow for economic mobility. By diversifyinginvestments and extended study, many Chinese have become not only secure but also verywealthy. Could the Western world learn something from Chinese diligence? CertainlyChina’s current economy reflects cultural values that benefit all people.</p>\n<p>a. the truth<br>b. the rain<br>C. clouds<br>d. friends’ expectations<br>e. enjoying the rain<br>f. spend the afternoon reading and make a pot of tea<br>g. damp weather and genuine rainforest</p>\n<p>I’ve got a deep secret few people understand and even fewer will admit to sharing. It’s time totell 1) <strong><strong>_ a_</strong></strong> :I love the rain, deeply and more than the sun. At least | live in the rightplace, famous for its 2)<strong><strong>_ gGray 3)_</strong></strong> Ccause many people around hereto suffer from emotional disorder. Yet I welcome 4).b_My reason for 5)<em>elies in pure selfishness - when it’s raining outside, | don’t haveto do anything. Ican 6)<em>f</em>Maybe I’ll invite a few friends over to watch an oldmovie or play a board game.7)</em> d (Friends’ expectations) are low and easy to meet.</p>\n<p>1 After graduation, she _ opened up_ a library in the countryside to enrich the local people’scultural life.2 The cultural exchange program will be more effective when combined with lectures andfield trips.3 When he arrived in China, he tried hard to change his habits and customs to___ fit intoChinese culture.4 China is committed to developing a friendly and cooperative relationship with all othercountries in the world.5 The Chinese custom of drinking hot water goes beyond simple preference; hot water isbelieved to lower the body’s temperature and restore the person’s health.6 International students bring differing cultural experiences, expectations, and learning stylesto the classroom thatallow for__ new perspectives to be introduced.7 The real value of this cross-cultural program___ rests in___ teaching our people a realisticatitude toward globalization.</p>\n<p>1 Practicing good corporate social responsibility (企业社会责任) can usuallyqivea company a good_ reputation_.2The Chinese. highly L greatly value_ social harmony and smoothness ofrelationships within the family.3 To protect consumers’ rights and ensure fair competition , the government iscareful to work out the laws about online shopping.4He informed me of the intense competition between students and howthey work hard to hopefully go to a famous university.5For long, the Chinese people have the/ a reputation of being afraid oflosing face or lian in Chinese.6 Ijust can’t stand people who complain loudly / constantly in public places.</p>\n<p>For a long time, the Chinese trait of being hard-working has been observed in both Western booksand Chinese literature and folklore. The Chinese were described by some Westerners as beingwithout 1)<strong>__ rest</strong>. Since ancient times, the Chinese have highly valued the virtue of hardwork and making 2)<em>maximum</em> use of time. Today, Chinese work ethic, the 3)<strong><em>_ belief</em> inhard work, continues to win a global respect. The Chinese never 4)_ complain_ about workinghard. Instead, they think of it as a(n) 5)_</strong> virtue__ which benefits them and their families. Thatis why many Western employers nowadays would 6)<strong><em>preferChinese employees. They makeup a(n) 7)</em></strong> stableand industrious workforce. This work ethic is not only for adults. It is acommon phenomenon that children and young students in China attend classes at night or atweekends. They participate in these activities not only because of the intense competition thatthey face, but also because of their desire to 8)<em>___ excel academically. Chinese 9)</em> diligencehas played a vital role in China’s economic development. Thanks to this trait, many Chinese peoplehave become not only financially secure but also 10)_ wealthy</p>\n<h3 id=\"explore-2-1\">Explore 2<a href=\"#explore-2-1\" title=\"Explore 2\"></a></h3><p>Whether you live in Cambodia or Scotland,Lithuania or America, you have probably heardof dragons. The Eastern dragon, called long inChina, may seem like a completely differentcreature from the Western dragon. Theirbehavior, their symbolism, and what they meanto society are quite different. The East seems tovalue dragons for their magic and beauty andholds them in high respect. However, it is a quitedifferent case in the West where dragons arehistorically viewed as monsters.</p>\n<p>2 In Chinese culture, the dragon is a symbol of virtue. Unlike Western dragons, orientaldragons are usually seen as kind and benevolent. Dragons have long been a symbol inChinese folklore and art. Temples and shrines have been built to honor them. In fact,the Chinese are sometimes referred to as“the descendants of the dragon.”Through the symbol of the dragon, many Chinese see qualities which they desireand value such as heroism, wisdom and power. The dragon is a protector. Legendhas it that the dragon controls the rain, rivers, lakes and the seas; they can protect theinnocent and give them safety. In real life, the Chinese have the Year of the Dragon. Itis said that anyone born in this year will be healthy, wealthy and wise. Historically, thedragon was associated with the emperor of China and used as a symbol to representimperial power. In order to emphasize the association, emperors wore robes with a dragon design, sat on a throne with carved dragons, and had his palace decorated withdragon of various patterns.Dragon idioms are common in China. Chinese idioms are usually made up of fourChinese characters, called chengyu. Many Westerners are familiar with the movieCrouching Tiger, Hidden Dragon, but do not know that this movie title is an idiommeaning “talents in hiding.’Likewise, the Chinese may include the character for dragon (“龙”) when naminga child. The character appears in the names of two famous movie stars that allWesterners know, Jackie Chan (Chenglong, meaning “becoming a dragon”) and BruceLee (Li Xiaolong, implying a “small dragon”).At special festivals, especially the Dragon Boat Festival, also called DuanwuFestival, dragon boat races play an important part. Typically, these are boatspaddled by a team of up to 20 paddlers with a drummer and a steersman. Theboats are generally with decorative dragon heads and tails. Dragon boat racingis also an important part of celebrations by ethnic Chinese outside China. Forexample, the dragon boat races held annually at Echo Park Lake in Los Angeles,California, are very popular.</p>\n<p>Western dragons have traditionally been a symbol of evil. A typical Western dragonhas wings and sharp claws, and breathes fire. Many legends describe dragons asgreedy, keeping huge amounts of gold and other precious treasure. Dragons aremonsters to be conquered. They are seen to represent the dark side of humanity,including greed, lust, and violence. The conquest of a dragon represents theelimination of those evil instincts.An important English legend is Saint George and the Dragon, a tale of goodovercoming evil. As the story goes, there lived a dragon in a town and it oftenkilled the townspeople. One day when the king’s daughter was offered to thedragon, Saint George happened to travel here. He killed the dragon and rescuedthe princess.But not all Western dragons are considered monsters. To the west of England in Wales,the Red Dragon has long been a national symbol, and is not regarded as evil. TheWelsh myth tells the story of a red dragon that fought a lengthy battle with his foe andwas victorious. The Red Dragon is now depicted on the Welsh national flag.It can be almost impossible to talk about dragons without being influenced by one’scultural heritage. But, regardless of one’s culture, everyone can appreciate the beautyof the Nine Dragon Screen in Beiing’ s Forbidden City.</p>\n<p>For Chinese people, the Qingming Festival, also known as the Tomb Sweeping Day, is atime to honor ancestors.In the legend of the White Snake, in order torescueher husband Xu Xian, BaiSuzhen used her powers to flood the temple where he was imprisoned.After the_ conquest of the Xiongnu nomads (游牧民), the Han emperor sent Zhang Qianto travel westward on a mission of peace.At some festivals in China, people hang_ decorative_ lanterns outside their doors.The Zhuang ethnic___ minority is China’s largest minority group with a long historyand glorious culture.As the two most-visited cities by foreign tourists, Bejjing and Shanghai boast rich tourismresources and uniqueoriental_charm.</p>\n<p>As an auspicious (吉祥的) beast, kylin (麒麟) is heldhigh respect in China andis expected to bring harvest, fortune and longevity.You must have heardthe Great Wall in China. Do you know what it wasoriginally used for?Foreigners may know specific Chinese cultural symbols such as panda and green tea, butmore abstract ones like Chinese philosophies and thearts.This set is made uppaper-cut patterns, showing the customs and clothingcharacteristics of different areas in China.The Yellow River is referredas one of the cradles of Chinese civilization, andthe development of the civilization here is closely related to the agricultural production.Ancient Chinese people associated the lion_braveness and strength, andbelieved that the lion could drive away evil and protect humans and farm animals.</p>\n<h3 id=\"翻译-2\">翻译<a href=\"#翻译-2\" title=\"翻译\"></a></h3><p>相传屈原投江后，人们划船前去营救，并向江中投放粽子。这就是端午节赛龙舟、吃粽子的由来。<br>( drown )<br>故宫博物院位于北京市中心的天安门广场北侧，建立在明朝和清朝的皇宫紫禁城的基础之.上。<br>( the Palace Museum; the imperial palace )<br>中国是茶叶的原产国，其喝茶的习惯通过古丝绸之路和其他贸易渠道传播到欧洲和很多其他地<br>区。( the Silk Road; channels of trade )<br>中国人讲究吃。吃不仅仅为解渴充饥，更蕴含着中国人认识事物、理解事物的哲理。( be<br>particular about; satisfy one’s hunger and thirst )</p>\n","prev":{"title":"VMware虚拟机的CentOS无法上网的解决方法","link":"posts/740f0ea7"},"next":{"title":"Step 3　该如何使用进阶的句子？","link":"posts/1b9f695a"},"plink":"https://dxsummer.gitee.io/posts/30564382/","toc":[{"id":"unit5","title":"Unit5","index":"1","children":[{"id":"explore-1","title":"Explore 1","index":"1.1"},{"id":"explore2","title":"explore2","index":"1.2"},{"id":"翻译","title":"翻译","index":"1.3"}]},{"id":"unit-7","title":"Unit 7","index":"2","children":[{"id":"explore-1-1","title":"Explore 1","index":"2.1"},{"id":"explore-2","title":"Explore 2","index":"2.2"},{"id":"翻译-1","title":"翻译","index":"2.3"}]},{"id":"unit-8","title":"Unit 8","index":"3","children":[{"id":"explore-1-2","title":"Explore 1","index":"3.1"},{"id":"explore-2-1","title":"Explore 2","index":"3.2"},{"id":"翻译-2","title":"翻译","index":"3.3"}]}],"reward":true,"copyright":{"author":"DxSummer","link":"<a href=\"https://dxsummer.gitee.io/posts/30564382/\" title=\"英语期末考试\">https://dxsummer.gitee.io/posts/30564382/</a>","license":"Attribution-NonCommercial-NoDerivatives 4.0 International (<a href=\\\"https://creativecommons.org/licenses/by-nc-sa/4.0/\\\" rel=\\\"external nofollow\\\" target=\\\"_blank\\\">CC BY-NC-ND 4.0</a>)","published":"2020年7月2日","updated":"2020年7月2日"}}